Revit 2024 API
RepeaterCoordinates Constructor (Int32, Int32)
 Creates two dimensional coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public RepeaterCoordinates(
	int x,
	int y
)
Visual Basic
Public Sub New ( _
	x As Integer, _
	y As Integer _
)
Visual C++
public:
RepeaterCoordinates(
	int x,
	int y
)
Parameters
x
Type: System.Int32
 The coordinate in first dimension.
y
Type: System.Int32
 The coordinate in second dimension.
See Also
RepeaterCoordinates Class
RepeaterCoordinates Overload
Autodesk.Revit.DB Namespace